#### Terraform Apply Results 🌟
Preview environment has been deployed. You can now test your changes.

<details><summary>Show Actual Apply</summary>

```

[0m[1mdata.aws_ecr_authorization_token.token: Reading...[0m[0m
[0m[1mmodule.api_gateway.data.aws_route53_zone.this[0]: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.lambda_container_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mdata.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.lambda_container_image.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.api_gateway.data.aws_route53_zone.this[0]: Read complete after 0s [id=Z00402303DMA4KDX72AUO][0m
[0m[1mdata.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.lambda_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=476469806][0m
[0m[1mdata.aws_ecr_authorization_token.token: Read complete after 0s [id=us-west-1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_dynamodb_table.basic-dynamodb-table[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "basic-dynamodb-table" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m billing_mode     = "PAY_PER_REQUEST"
      [32m+[0m[0m hash_key         = "demo_id"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "demo"
      [32m+[0m[0m read_capacity    = (known after apply)
      [32m+[0m[0m stream_arn       = (known after apply)
      [32m+[0m[0m stream_label     = (known after apply)
      [32m+[0m[0m stream_view_type = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Service" = "demo_service"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m write_capacity   = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "demo_id"
          [32m+[0m[0m type = "S"
        }
    }

[1m  # random_string.this[0m will be created
[0m  [32m+[0m[0m resource "random_string" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 4
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.api_gateway.aws_apigatewayv2_api.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_api" "this" {
      [32m+[0m[0m api_endpoint                 = (known after apply)
      [32m+[0m[0m api_key_selection_expression = "$request.header.x-api-key"
      [32m+[0m[0m arn                          = (known after apply)
      [32m+[0m[0m description                  = "Demo api gateway to lambda container image"
      [32m+[0m[0m disable_execute_api_endpoint = true
      [32m+[0m[0m execution_arn                = (known after apply)
      [32m+[0m[0m fail_on_warnings             = false
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m name                         = "preview-demo_service"
      [32m+[0m[0m protocol_type                = "HTTP"
      [32m+[0m[0m route_selection_expression   = "$request.method $request.path"
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "Service"               = "demo_service"
          [32m+[0m[0m "terraform-aws-modules" = "apigateway-v2"
        }
      [32m+[0m[0m tags_all                     = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"               = "demo_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "apigateway-v2"
        }

      [32m+[0m[0m cors_configuration {
          [32m+[0m[0m allow_headers = [
              [32m+[0m[0m "authorization",
              [32m+[0m[0m "content-type",
              [32m+[0m[0m "x-amz-date",
              [32m+[0m[0m "x-amz-security-token",
              [32m+[0m[0m "x-amz-user-agent",
              [32m+[0m[0m "x-api-key",
            ]
          [32m+[0m[0m allow_methods = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m allow_origins = [
              [32m+[0m[0m "*",
            ]
        }
    }

[1m  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_api_mapping" "this" {
      [32m+[0m[0m api_id      = (known after apply)
      [32m+[0m[0m domain_name = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m stage       = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_domain_name.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_domain_name" "this" {
      [32m+[0m[0m api_mapping_selection_expression = (known after apply)
      [32m+[0m[0m arn                              = (known after apply)
      [32m+[0m[0m domain_name                      = "*.awseducate.systems"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m tags                             = {
          [32m+[0m[0m "Service" = "demo_service"
        }
      [32m+[0m[0m tags_all                         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m domain_name_configuration {
          [32m+[0m[0m certificate_arn                        = (known after apply)
          [32m+[0m[0m endpoint_type                          = "REGIONAL"
          [32m+[0m[0m hosted_zone_id                         = (known after apply)
          [32m+[0m[0m ownership_verification_certificate_arn = (known after apply)
          [32m+[0m[0m security_policy                        = "TLS_1_2"
          [32m+[0m[0m target_domain_name                     = (known after apply)
        }
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["$default"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["ANY /"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["GET /demo"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["$default"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "NONE"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "$default"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["ANY /"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "NONE"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "ANY /"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["GET /demo"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "NONE"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "GET /demo"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_stage.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_stage" "this" {
      [32m+[0m[0m api_id        = (known after apply)
      [32m+[0m[0m arn           = (known after apply)
      [32m+[0m[0m auto_deploy   = true
      [32m+[0m[0m deployment_id = (known after apply)
      [32m+[0m[0m execution_arn = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m invoke_url    = (known after apply)
      [32m+[0m[0m name          = "preview"
      [32m+[0m[0m tags          = {
          [32m+[0m[0m "Service" = "demo_service"
        }
      [32m+[0m[0m tags_all      = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m access_log_settings {
          [32m+[0m[0m destination_arn = (known after apply)
          [32m+[0m[0m format          = jsonencode(
                {
                  [32m+[0m[0m context = {
                      [32m+[0m[0m domainName              = "$context.domainName"
                      [32m+[0m[0m error                   = {
                          [32m+[0m[0m message      = "$context.error.message"
                          [32m+[0m[0m responseType = "$context.error.responseType"
                        }
                      [32m+[0m[0m identity                = {
                          [32m+[0m[0m sourceIP = "$context.identity.sourceIp"
                        }
                      [32m+[0m[0m integration             = {
                          [32m+[0m[0m error             = "$context.integration.error"
                          [32m+[0m[0m integrationStatus = "$context.integration.integrationStatus"
                        }
                      [32m+[0m[0m integrationErrorMessage = "$context.integrationErrorMessage"
                      [32m+[0m[0m protocol                = "$context.protocol"
                      [32m+[0m[0m requestId               = "$context.requestId"
                      [32m+[0m[0m requestTime             = "$context.requestTime"
                      [32m+[0m[0m responseLength          = "$context.responseLength"
                      [32m+[0m[0m routeKey                = "$context.routeKey"
                      [32m+[0m[0m stage                   = "$context.stage"
                      [32m+[0m[0m status                  = "$context.status"
                    }
                }
            )
        }

      [32m+[0m[0m default_route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m throttling_burst_limit   = 100
          [32m+[0m[0m throttling_rate_limit    = 100
        }

      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = false
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "ANY /"
          [32m+[0m[0m throttling_burst_limit   = 100
          [32m+[0m[0m throttling_rate_limit    = 100
        }
      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "$default"
          [32m+[0m[0m throttling_burst_limit   = 100
          [32m+[0m[0m throttling_rate_limit    = 100
        }
      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "GET /demo"
          [32m+[0m[0m throttling_burst_limit   = 40
          [32m+[0m[0m throttling_rate_limit    = 80
        }
    }

[1m  # module.api_gateway.aws_cloudwatch_log_group.this["this"][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/apigateway/preview-demo_service/preview"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Service" = "demo_service"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "this" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "preview-demo-service-internal-api-tpet"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00402303DMA4KDX72AUO"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = false
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # module.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-AAAA"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "this" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "preview-demo-service-internal-api-tpet"
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00402303DMA4KDX72AUO"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = false
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # module.docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "734bb88b794cb004822961844f2acec07aac06ba"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "."
          [32m+[0m[0m dockerfile     = "./context/Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "734bb88b794cb004822961844f2acec07aac06ba"
        }
    }

[1m  # module.lambda_container_image.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.lambda_container_image.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.lambda_container_image.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:dynamodb:us-west-1:070576557102:table/demo"
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.lambda_container_image.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.lambda_container_image.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.lambda_container_image.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.lambda_container_image.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.lambda_container_image.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "This is a demo, for lambda container image"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Service"               = "demo_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"               = "demo_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 60
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "ENVIRONMENT" = "preview"
              [32m+[0m[0m "SERVICE"     = "demo_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }
    }

[1m  # module.lambda_container_image.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.lambda_container_image.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.api_gateway.module.acm.aws_acm_certificate.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate" "this" {
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m domain_name               = "awseducate.systems"
      [32m+[0m[0m domain_validation_options = [
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "*.awseducate.systems"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "awseducate.systems"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
        ]
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m key_algorithm             = (known after apply)
      [32m+[0m[0m not_after                 = (known after apply)
      [32m+[0m[0m not_before                = (known after apply)
      [32m+[0m[0m pending_renewal           = (known after apply)
      [32m+[0m[0m renewal_eligibility       = (known after apply)
      [32m+[0m[0m renewal_summary           = (known after apply)
      [32m+[0m[0m status                    = (known after apply)
      [32m+[0m[0m subject_alternative_names = [
          [32m+[0m[0m "*.awseducate.systems",
          [32m+[0m[0m "awseducate.systems",
        ]
      [32m+[0m[0m tags                      = {
          [32m+[0m[0m "Service" = "demo_service"
        }
      [32m+[0m[0m tags_all                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          [32m+[0m[0m "Service"     = "demo_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m type                      = (known after apply)
      [32m+[0m[0m validation_emails         = (known after apply)
      [32m+[0m[0m validation_method         = "DNS"

      [32m+[0m[0m options {
          [32m+[0m[0m certificate_transparency_logging_preference = "ENABLED"
        }
    }

[1m  # module.api_gateway.module.acm.aws_acm_certificate_validation.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate_validation" "this" {
      [32m+[0m[0m certificate_arn         = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m validation_record_fqdns = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.api_gateway.module.acm.aws_route53_record.validation[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "validation" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = (known after apply)
      [32m+[0m[0m zone_id         = "Z00402303DMA4KDX72AUO"
    }

[1mPlan:[0m 31 to add, 0 to change, 0 to destroy.
[0m[0m[1mrandom_string.this: Creating...[0m[0m
[0m[1mrandom_string.this: Creation complete after 0s [id=he4e][0m
[0m[1mmodule.lambda_container_image.aws_iam_role.lambda[0]: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_cloudwatch_log_group.lambda[0]: Creating...[0m[0m
[0m[1maws_dynamodb_table.basic-dynamodb-table: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_cloudwatch_log_group.this["this"]: Creating...[0m[0m
[0m[1mmodule.docker_image.aws_ecr_repository.this[0]: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_iam_policy.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.module.acm.aws_acm_certificate.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api.this[0]: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_iam_policy.additional_inline[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-demo_service-from_terraform_module_function-he4e-inline][0m
[0m[1mmodule.lambda_container_image.aws_iam_role.lambda[0]: Creation complete after 0s [id=preview-demo_service-from_terraform_module_function-he4e][0m
[0m[1mmodule.lambda_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Creation complete after 0s [id=preview-demo_service-from_terraform_module_function-he4e-20240627221632328500000002][0m
[0m[1mmodule.lambda_container_image.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/preview-demo_service-from_terraform_module_function-he4e][0m
[0m[1mmodule.lambda_container_image.data.aws_iam_policy_document.logs[0]: Reading...[0m[0m
[0m[1mmodule.lambda_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=563823346][0m
[0m[1mmodule.lambda_container_image.aws_iam_policy.logs[0]: Creating...[0m[0m
[0m[1mmodule.docker_image.aws_ecr_repository.this[0]: Creation complete after 1s [id=preview-demo_service-from_terraform_module_function-he4e][0m
[0m[1mmodule.docker_image.aws_ecr_lifecycle_policy.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_cloudwatch_log_group.this["this"]: Creation complete after 1s [id=/aws/apigateway/preview-demo_service/preview][0m
[0m[1mmodule.docker_image.docker_image.this: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_iam_policy.logs[0]: Creation complete after 1s [id=arn:aws:iam::070576557102:policy/preview-demo_service-from_terraform_module_function-he4e-logs][0m
[0m[1mmodule.lambda_container_image.aws_iam_role_policy_attachment.logs[0]: Creating...[0m[0m
[0m[1mmodule.docker_image.aws_ecr_lifecycle_policy.this[0]: Creation complete after 0s [id=preview-demo_service-from_terraform_module_function-he4e][0m
[0m[1mmodule.lambda_container_image.aws_iam_role_policy_attachment.logs[0]: Creation complete after 0s [id=preview-demo_service-from_terraform_module_function-he4e-20240627221632892900000003][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api.this[0]: Creation complete after 2s [id=qei6w7p2wa][0m
[0m[1maws_dynamodb_table.basic-dynamodb-table: Creation complete after 7s [id=demo][0m
[0m[1mmodule.api_gateway.module.acm.aws_acm_certificate.this[0]: Creation complete after 9s [id=arn:aws:acm:us-west-1:070576557102:certificate/be5d92d5-2341-4721-8eef-4d4d0eef4cb9][0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Creating...[0m[0m
[0m[1mmodule.docker_image.docker_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.docker_image.docker_image.this: Creation complete after 18s [id=sha256:f60c432899e0fc6300cfae89e666ff57ab2c12346cfb70cc4a7bdfa14a2bd185070576557102.dkr.ecr.us-west-1.amazonaws.com/preview-demo_service-from_terraform_module_function-he4e][0m
[0m[1mmodule.docker_image.docker_registry_image.this: Creating...[0m[0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.docker_image.docker_registry_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Still creating... [20s elapsed][0m[0m
[0m[1mmodule.docker_image.docker_registry_image.this: Creation complete after 18s [id=sha256:109088ff5faeeec717244f05800c78e5bbab6074ed187579ff57a840ab65e9dd][0m
[0m[1mmodule.lambda_container_image.aws_lambda_function.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Still creating... [30s elapsed][0m[0m
[0m[1mmodule.lambda_container_image.aws_lambda_function.this[0]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Still creating... [40s elapsed][0m[0m
[0m[1mmodule.lambda_container_image.aws_lambda_function.this[0]: Creation complete after 19s [id=preview-demo_service-from_terraform_module_function-he4e][0m
[0m[1mmodule.lambda_container_image.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["ANY /"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["GET /demo"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["$default"]: Creating...[0m[0m
[0m[1mmodule.lambda_container_image.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 1s [id=AllowExecutionFromAPIGateway20240627221729480300000004][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["GET /demo"]: Creation complete after 1s [id=f8n8dxp][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["$default"]: Creation complete after 1s [id=zfscn9c][0m
[0m[1mmodule.lambda_container_image.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 1s [id=AllowExecutionFromAPIGateway20240627221729481200000005][0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Still creating... [50s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["ANY /"]: Creation complete after 3s [id=ilgwa0u][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["ANY /"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["GET /demo"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["$default"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["GET /demo"]: Creation complete after 0s [id=2fa8b6f][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["$default"]: Creation complete after 0s [id=s92j3f5][0m
[0m[1mmodule.api_gateway.module.acm.aws_route53_record.validation[0]: Creation complete after 51s [id=Z00402303DMA4KDX72AUO__428bd6fc94fdae60f23736f2bc1413a1.awseducate.systems._CNAME][0m
[0m[1mmodule.api_gateway.module.acm.aws_acm_certificate_validation.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["ANY /"]: Creation complete after 0s [id=37x6c4j][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_stage.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.module.acm.aws_acm_certificate_validation.this[0]: Creation complete after 1s [id=2024-06-27 22:16:55.224 +0000 UTC][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_domain_name.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_stage.this[0]: Creation complete after 1s [id=preview][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_domain_name.this[0]: Creation complete after 2s [id=*.awseducate.systems][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-AAAA"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Creation complete after 0s [id=xpiiwl][0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-AAAA"]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"]: Still creating... [20s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-AAAA"]: Still creating... [20s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-AAAA"]: Creation complete after 27s [id=Z00402303DMA4KDX72AUO_preview-demo-service-internal-api-tpet_AAAA][0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"]: Still creating... [30s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"]: Still creating... [40s elapsed][0m[0m
[0m[1mmodule.api_gateway.aws_route53_record.this["preview-demo-service-internal-api-tpet-A"]: Creation complete after 40s [id=Z00402303DMA4KDX72AUO_preview-demo-service-internal-api-tpet_A][0m
[0m[1m[32m
Apply complete! Resources: 31 added, 0 changed, 0 destroyed.
[0m
```

</details>

*Pushed by: @sh1un, Action: `pull_request`*